load/results/20260914-024204-catalog-read-vus5.txt


  █ TOTAL RESULTS 

    checks_total.......: 8533    414.671881/s
    checks_succeeded...: 100.00% 8533 out of 8533
    checks_failed......: 0.00%   0 out of 8533

    ✓ catalog list 200

    HTTP
    http_req_duration..............: avg=11.92ms min=748µs med=6.66ms max=2.11s p(90)=12.34ms p(95)=16.35ms
      { expected_response:true }...: avg=11.92ms min=748µs med=6.66ms max=2.11s p(90)=12.34ms p(95)=16.35ms
    http_req_failed................: 0.00%  0 out of 8533
    http_reqs......................: 8533   414.671881/s

    EXECUTION
    iteration_duration.............: avg=12.04ms min=748µs med=6.74ms max=2.11s p(90)=12.52ms p(95)=16.74ms
    iterations.....................: 8533   414.671881/s
    vus............................: 5      min=5         max=5
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 17 MB  832 kB/s
    data_sent......................: 879 kB 43 kB/s