load/results/20260914-024306-orders-read-vus5.txt


  █ TOTAL RESULTS 

    checks_total.......: 10849   542.248967/s
    checks_succeeded...: 100.00% 10849 out of 10849
    checks_failed......: 0.00%   0 out of 10849

    ✓ orders list 200

    HTTP
    http_req_duration..............: avg=9.08ms min=505.2µs med=6.5ms max=762.83ms p(90)=11.02ms p(95)=14.52ms
      { expected_response:true }...: avg=9.08ms min=505.2µs med=6.5ms max=762.83ms p(90)=11.02ms p(95)=14.52ms
    http_req_failed................: 0.00%  0 out of 10849
    http_reqs......................: 10849  542.248967/s

    EXECUTION
    iteration_duration.............: avg=9.2ms  min=505.2µs med=6.6ms max=762.83ms p(90)=11.15ms p(95)=14.76ms
    iterations.....................: 10849  542.248967/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 51 MB  2.5 MB/s
    data_sent......................: 1.3 MB 63 kB/s