load/results/20260914-024509-orders-write-vus8.txt


  █ TOTAL RESULTS 

    checks_total.......: 201    9.620923/s
    checks_succeeded...: 99.50% 200 out of 201
    checks_failed......: 0.49%  1 out of 201

    ✗ order created 201
      ↳  99% — ✓ 100 / ✗ 1
    ✓ order deleted 204

    HTTP
    http_req_duration..............: avg=806.08ms min=42.88ms  med=474.28ms max=5.72s p(90)=2.03s p(95)=2.48s
      { expected_response:true }...: avg=781.72ms min=42.88ms  med=474.11ms max=5.05s p(90)=1.95s p(95)=2.45s
    http_req_failed................: 0.49% 1 out of 203
    http_reqs......................: 203   9.716654/s

    EXECUTION
    iteration_duration.............: avg=1.61s    min=154.75ms med=1.29s    max=5.97s p(90)=3.2s  p(95)=4.24s
    iterations.....................: 101   4.834394/s
    vus............................: 8     min=8        max=8
    vus_max........................: 8     min=8        max=8

    NETWORK
    data_received..................: 39 kB 1.8 kB/s
    data_sent......................: 50 kB 2.4 kB/s